# NoInstparamFormulas Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..NoInstparamFormulas Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Instance Parameters can't be used in Type Parameter formulas.\n\n[Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoInstparamFormulas { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoInstparamFormulas As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoInstparamFormulas {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace